"""
==========================================
Wind Chart Extractor
Configuration File
==========================================
"""

from pathlib import Path

# --------------------------------------------------
# مسیر PDF ها
# --------------------------------------------------

INPUT_FOLDER = Path(
    r"C:\Users\M\Downloads\New folder"
)

# --------------------------------------------------
# پوشه خروجی
# --------------------------------------------------

OUTPUT_FOLDER = Path("output")
OUTPUT_FOLDER.mkdir(exist_ok=True)

# --------------------------------------------------
# کیفیت خروجی
# --------------------------------------------------

DPI = 300

ZOOM = DPI / 72

# --------------------------------------------------
# متن هایی که وجودشان یعنی صفحه نمودار است
# --------------------------------------------------

KEYWORDS = [

    "WS 10",
    "WG 10",
    "WS 50",
    "WG 50"

]

# --------------------------------------------------
# برش تصویر
# (در صورت نیاز بعداً تنظیم می‌کنیم)
# --------------------------------------------------

LEFT = 320
TOP = 420
RIGHT = 250
BOTTOM = 2200

# --------------------------------------------------
# نمایش زمان اجرا
# --------------------------------------------------

SHOW_TIME = True

# --------------------------------------------------
# فایل‌هایی که شماره صفحه آنها ثابت است
# --------------------------------------------------

FIXED_PAGE = {

    "Aboozar":4,

    "Bahregan":4,

    "Balal_Gas_Field":5,

    "Bushehr":8,

    "Froozan":4,

    "Khark":4,

    "Kish":4,

    "Lavan":4,

    "Nasr2":4,

    "Qeshm":4,

    "Reshadat":4,

    "Roudsar":4,

    "Shafagh":5,

    "Siri":4,

    "Southpars":4

}

# --------------------------------------------------
# فایل‌های دارای دو خروجی
# --------------------------------------------------

MULTI_PAGE = {

    "Route_Asaluyeh_Anchorage_Phase11":{

        6:"عسلویه",

        7:"میانی عسلویه"

    },

    "Route_Lavan_Salman":{

        7:"میانی سلمان",

        8:"سلمان"

    }

}
